interface NumberWords {
  [key: number]: string;
}
export function numberToPersianWords(num: number): string {
  const numbersToWords: NumberWords = {
    1: "یک",
    2: "دو",
    3: "سه",
    4: "چهار",
    5: "پنج",
    6: "شش",
    7: "هفت",
    8: "هشت",
    9: "نه",
    10: "ده",
    11: "یازده",
    12: "دوازده",
    13: "سیزده",
    14: "چهارده",
    15: "پانزده",
    16: "شانزده",
    17: "هفده",
    18: "هجده",
    19: "نوزده",
    20: "بیست",
    21: "بیست و یک",
    22: "بیست و دو",
    23: "بیست و سه",
    24: "بیست و چهار",
    25: "بیست و پنج",
    26: "بیست و شش",
    27: "بیست و هفت",
    28: "بیست و هشت",
    29: "بیست و نه",
    30: "سی",
    31: "سی و یک",
  };

  return numbersToWords[num] || num.toString();
}
